const bannerJSON = [{
    'text':'децентралізована віртуальна валюта, заснована на математичних алгоритмах та захищена методами криптографії. Перша у світі криптовалюта – біткоїн – також є децентралізованою і створювалася насамперед як аналог сучасним грошам.',
    'header': 'Дізнайся основну інформацію',
    'special':'Криптовалюта (cryptocurrency) ',
    'button':'Читати більше',
    'img': 'img/mainpage/currency.png',
    'direction': true,
    'link':'/blog'
}, {
    'text':'Спробуй торгувати як на справжній біржі на твоєму демо рахунку, це допоможе краще зрозуміти принцип торгівлі на криптобіржах, розпочни зараз і ознайомся із реаліями майбутнього, ',
    'header': 'Наша демо біржа',
    'special':' кожен клац вирішує твоє майбутнє',
    'button':'Спробувати',
    'img': 'img/mainpage/grafic.png',
    'direction': false,
    'link':'/trade'
}, {
    'text':'Даний сайт пропонує отримувати найновішу інформацію про стан курсів криптовалют, щоб ти зміг завжди бути в темі',
    'header': 'Діставай актуальну інформацію про курси валют',
    'special':' ',
    'button':'Переглянути',
    'img':'img/mainpage/current.jpg',
    'direction': true,
    'link':'/courses'
}]

export default bannerJSON